; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x7-y7-t4-k3333-l3333-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f 
        f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f 
        shape0 shape1 shape2 shape3 
        key0-0 key0-1 key0-2 
        key1-0 key1-1 key1-2 
        key2-0 key2-1 key2-2 
        key3-0 key3-1 key3-2 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f6-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f6-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f6-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f6-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f6-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(place f6-5f)
(place f0-6f)
(place f1-6f)
(place f2-6f)
(place f3-6f)
(place f4-6f)
(place f5-6f)
(place f6-6f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(key key3-0)
(key-shape key3-0 shape3)
(key key3-1)
(key-shape key3-1 shape3)
(key key3-2)
(key-shape key3-2 shape3)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f5-0f f6-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f5-1f f6-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f5-2f f6-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f5-3f f6-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f5-4f f6-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f5-5f f6-5f)
(conn f0-6f f1-6f)
(conn f1-6f f2-6f)
(conn f2-6f f3-6f)
(conn f3-6f f4-6f)
(conn f4-6f f5-6f)
(conn f5-6f f6-6f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f6-0f f6-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f6-1f f6-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f6-2f f6-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f6-3f f6-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f6-4f f6-5f)
(conn f0-5f f0-6f)
(conn f1-5f f1-6f)
(conn f2-5f f2-6f)
(conn f3-5f f3-6f)
(conn f4-5f f4-6f)
(conn f5-5f f5-6f)
(conn f6-5f f6-6f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f6-0f f5-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f6-1f f5-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f6-2f f5-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f6-3f f5-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f6-4f f5-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f6-5f f5-5f)
(conn f1-6f f0-6f)
(conn f2-6f f1-6f)
(conn f3-6f f2-6f)
(conn f4-6f f3-6f)
(conn f5-6f f4-6f)
(conn f6-6f f5-6f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f6-1f f6-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f6-2f f6-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f6-3f f6-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f6-4f f6-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(conn f6-5f f6-4f)
(conn f0-6f f0-5f)
(conn f1-6f f1-5f)
(conn f2-6f f2-5f)
(conn f3-6f f3-5f)
(conn f4-6f f4-5f)
(conn f5-6f f5-5f)
(conn f6-6f f6-5f)
(open f0-0f)
(open f2-0f)
(open f3-0f)
(open f6-0f)
(open f0-1f)
(open f1-1f)
(open f3-1f)
(open f4-1f)
(open f5-1f)
(open f6-1f)
(open f1-2f)
(open f2-2f)
(open f4-2f)
(open f5-2f)
(open f0-3f)
(open f1-3f)
(open f2-3f)
(open f3-3f)
(open f4-3f)
(open f6-3f)
(open f0-4f)
(open f1-4f)
(open f2-4f)
(open f3-4f)
(open f4-4f)
(open f6-4f)
(open f0-5f)
(open f1-5f)
(open f2-5f)
(open f3-5f)
(open f5-5f)
(open f6-5f)
(open f0-6f)
(open f2-6f)
(open f3-6f)
(open f5-6f)
(open f6-6f)
(locked f4-6f)
(lock-shape f4-6f shape0)
(locked f5-4f)
(lock-shape f5-4f shape0)
(locked f1-6f)
(lock-shape f1-6f shape0)
(locked f3-2f)
(lock-shape f3-2f shape1)
(locked f5-3f)
(lock-shape f5-3f shape1)
(locked f4-5f)
(lock-shape f4-5f shape1)
(locked f2-1f)
(lock-shape f2-1f shape2)
(locked f6-2f)
(lock-shape f6-2f shape2)
(locked f4-0f)
(lock-shape f4-0f shape2)
(locked f5-0f)
(lock-shape f5-0f shape3)
(locked f1-0f)
(lock-shape f1-0f shape3)
(locked f0-2f)
(lock-shape f0-2f shape3)
(at key0-0 f2-2f)
(at key0-1 f6-3f)
(at key0-2 f4-3f)
(at key1-0 f2-6f)
(at key1-1 f3-5f)
(at key1-2 f3-2f)
(at key2-0 f2-5f)
(at key2-1 f2-0f)
(at key2-2 f6-0f)
(at key3-0 f3-0f)
(at key3-1 f1-0f)
(at key3-2 f0-5f)
(at-robot f3-1f)
)
(:goal
(and
(at key0-0 f3-4f)
(at key0-2 f4-0f)
(at key1-0 f5-6f)
(at key1-1 f2-3f)
(at key1-2 f6-6f)
(at key2-0 f0-1f)
(at key2-1 f5-1f)
(at key2-2 f3-1f)
)
)
)

; plan
1. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 0 of 8
2. (move f4-1f f4-2f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 0 of 8
3. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 0 of 8
4. (pickup f4-3f key0-2)
   deleted: (at key0-2 f4-3f) (arm-empty)
   added: (holding key0-2)
   goals met: 0 of 8
5. (move f4-3f f3-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f3-3f)
   goals met: 0 of 8
6. (move f3-3f f2-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f2-3f)
   goals met: 0 of 8
7. (move f2-3f f2-4f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-4f)
   goals met: 0 of 8
8. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 0 of 8
9. (move f2-5f f2-6f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-6f)
   goals met: 0 of 8
10. (move f2-6f f3-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f3-6f)
   goals met: 0 of 8
11. (unlock f3-6f f4-6f key0-2 shape0)
   deleted: (locked f4-6f)
   added: (open f4-6f)
   goals met: 0 of 8
12. (move f3-6f f3-5f)
   deleted: (at-robot f3-6f)
   added: (at-robot f3-5f)
   goals met: 0 of 8
13. (pickup-and-loose f3-5f key1-1 key0-2)
   deleted: (holding key0-2) (at key1-1 f3-5f)
   added: (holding key1-1) (at key0-2 f3-5f)
   goals met: 0 of 8
14. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 0 of 8
15. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 0 of 8
16. (unlock f3-3f f3-2f key1-1 shape1)
   deleted: (locked f3-2f)
   added: (open f3-2f)
   goals met: 0 of 8
17. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 0 of 8
18. (move f3-2f f3-1f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-1f)
   goals met: 0 of 8
19. (move f3-1f f3-0f)
   deleted: (at-robot f3-1f)
   added: (at-robot f3-0f)
   goals met: 0 of 8
20. (move f3-0f f2-0f)
   deleted: (at-robot f3-0f)
   added: (at-robot f2-0f)
   goals met: 0 of 8
21. (pickup-and-loose f2-0f key2-1 key1-1)
   deleted: (holding key1-1) (at key2-1 f2-0f)
   added: (holding key2-1) (at key1-1 f2-0f)
   goals met: 0 of 8
22. (move f2-0f f3-0f)
   deleted: (at-robot f2-0f)
   added: (at-robot f3-0f)
   goals met: 0 of 8
23. (unlock f3-0f f4-0f key2-1 shape2)
   deleted: (locked f4-0f)
   added: (open f4-0f)
   goals met: 0 of 8
24. (move f3-0f f3-1f)
   deleted: (at-robot f3-0f)
   added: (at-robot f3-1f)
   goals met: 0 of 8
25. (unlock f3-1f f2-1f key2-1 shape2)
   deleted: (locked f2-1f)
   added: (open f2-1f)
   goals met: 0 of 8
26. (move f3-1f f3-0f)
   deleted: (at-robot f3-1f)
   added: (at-robot f3-0f)
   goals met: 0 of 8
27. (move f3-0f f2-0f)
   deleted: (at-robot f3-0f)
   added: (at-robot f2-0f)
   goals met: 0 of 8
28. (pickup-and-loose f2-0f key1-1 key2-1)
   deleted: (holding key2-1) (at key1-1 f2-0f)
   added: (holding key1-1) (at key2-1 f2-0f)
   goals met: 0 of 8
29. (move f2-0f f2-1f)
   deleted: (at-robot f2-0f)
   added: (at-robot f2-1f)
   goals met: 0 of 8
30. (move f2-1f f2-2f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-2f)
   goals met: 0 of 8
31. (move f2-2f f2-3f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-3f)
   goals met: 0 of 8
32. (putdown f2-3f key1-1)
   deleted: (holding key1-1)
   added: (arm-empty) (at key1-1 f2-3f)
   goals met: 1 of 8
33. (move f2-3f f2-2f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-2f)
   goals met: 1 of 8
34. (move f2-2f f2-1f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 1 of 8
35. (move f2-1f f2-0f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-0f)
   goals met: 1 of 8
36. (pickup f2-0f key2-1)
   deleted: (at key2-1 f2-0f) (arm-empty)
   added: (holding key2-1)
   goals met: 1 of 8
37. (move f2-0f f3-0f)
   deleted: (at-robot f2-0f)
   added: (at-robot f3-0f)
   goals met: 1 of 8
38. (move f3-0f f3-1f)
   deleted: (at-robot f3-0f)
   added: (at-robot f3-1f)
   goals met: 1 of 8
39. (move f3-1f f2-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 1 of 8
40. (move f2-1f f2-2f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-2f)
   goals met: 1 of 8
41. (pickup-and-loose f2-2f key0-0 key2-1)
   deleted: (holding key2-1) (at key0-0 f2-2f)
   added: (holding key0-0) (at key2-1 f2-2f)
   goals met: 1 of 8
42. (move f2-2f f2-1f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 1 of 8
43. (move f2-1f f3-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f3-1f)
   goals met: 1 of 8
44. (move f3-1f f3-2f)
   deleted: (at-robot f3-1f)
   added: (at-robot f3-2f)
   goals met: 1 of 8
45. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 1 of 8
46. (move f3-3f f3-4f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-4f)
   goals met: 1 of 8
47. (putdown f3-4f key0-0)
   deleted: (holding key0-0)
   added: (arm-empty) (at key0-0 f3-4f)
   goals met: 2 of 8
48. (move f3-4f f3-5f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-5f)
   goals met: 2 of 8
49. (pickup f3-5f key0-2)
   deleted: (at key0-2 f3-5f) (arm-empty)
   added: (holding key0-2)
   goals met: 2 of 8
50. (move f3-5f f2-5f)
   deleted: (at-robot f3-5f)
   added: (at-robot f2-5f)
   goals met: 2 of 8
51. (pickup-and-loose f2-5f key2-0 key0-2)
   deleted: (holding key0-2) (at key2-0 f2-5f)
   added: (holding key2-0) (at key0-2 f2-5f)
   goals met: 2 of 8
52. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 2 of 8
53. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 2 of 8
54. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 2 of 8
55. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 2 of 8
56. (move f3-2f f2-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f2-2f)
   goals met: 2 of 8
57. (move f2-2f f2-1f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 2 of 8
58. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 2 of 8
59. (move f1-1f f0-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f0-1f)
   goals met: 2 of 8
60. (putdown f0-1f key2-0)
   deleted: (holding key2-0)
   added: (arm-empty) (at key2-0 f0-1f)
   goals met: 3 of 8
61. (move f0-1f f1-1f)
   deleted: (at-robot f0-1f)
   added: (at-robot f1-1f)
   goals met: 3 of 8
62. (move f1-1f f2-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f2-1f)
   goals met: 3 of 8
63. (move f2-1f f2-2f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-2f)
   goals met: 3 of 8
64. (pickup f2-2f key2-1)
   deleted: (at key2-1 f2-2f) (arm-empty)
   added: (holding key2-1)
   goals met: 3 of 8
65. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 3 of 8
66. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 3 of 8
67. (move f3-3f f3-4f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-4f)
   goals met: 3 of 8
68. (move f3-4f f3-5f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-5f)
   goals met: 3 of 8
69. (move f3-5f f2-5f)
   deleted: (at-robot f3-5f)
   added: (at-robot f2-5f)
   goals met: 3 of 8
70. (pickup-and-loose f2-5f key0-2 key2-1)
   deleted: (holding key2-1) (at key0-2 f2-5f)
   added: (holding key0-2) (at key2-1 f2-5f)
   goals met: 3 of 8
71. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 3 of 8
72. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 3 of 8
73. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 3 of 8
74. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 3 of 8
75. (move f3-2f f3-1f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-1f)
   goals met: 3 of 8
76. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 3 of 8
77. (move f4-1f f4-0f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-0f)
   goals met: 3 of 8
78. (putdown f4-0f key0-2)
   deleted: (holding key0-2)
   added: (arm-empty) (at key0-2 f4-0f)
   goals met: 4 of 8
79. (move f4-0f f4-1f)
   deleted: (at-robot f4-0f)
   added: (at-robot f4-1f)
   goals met: 4 of 8
80. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 4 of 8
81. (move f3-1f f3-2f)
   deleted: (at-robot f3-1f)
   added: (at-robot f3-2f)
   goals met: 4 of 8
82. (pickup f3-2f key1-2)
   deleted: (at key1-2 f3-2f) (arm-empty)
   added: (holding key1-2)
   goals met: 4 of 8
83. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 4 of 8
84. (move f3-3f f3-4f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-4f)
   goals met: 4 of 8
85. (move f3-4f f3-5f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-5f)
   goals met: 4 of 8
86. (move f3-5f f3-6f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-6f)
   goals met: 4 of 8
87. (move f3-6f f4-6f)
   deleted: (at-robot f3-6f)
   added: (at-robot f4-6f)
   goals met: 4 of 8
88. (move f4-6f f5-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f5-6f)
   goals met: 4 of 8
89. (move f5-6f f6-6f)
   deleted: (at-robot f5-6f)
   added: (at-robot f6-6f)
   goals met: 4 of 8
90. (putdown f6-6f key1-2)
   deleted: (holding key1-2)
   added: (arm-empty) (at key1-2 f6-6f)
   goals met: 5 of 8
91. (move f6-6f f5-6f)
   deleted: (at-robot f6-6f)
   added: (at-robot f5-6f)
   goals met: 5 of 8
92. (move f5-6f f4-6f)
   deleted: (at-robot f5-6f)
   added: (at-robot f4-6f)
   goals met: 5 of 8
93. (move f4-6f f3-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f3-6f)
   goals met: 5 of 8
94. (move f3-6f f2-6f)
   deleted: (at-robot f3-6f)
   added: (at-robot f2-6f)
   goals met: 5 of 8
95. (pickup f2-6f key1-0)
   deleted: (at key1-0 f2-6f) (arm-empty)
   added: (holding key1-0)
   goals met: 5 of 8
96. (move f2-6f f2-5f)
   deleted: (at-robot f2-6f)
   added: (at-robot f2-5f)
   goals met: 5 of 8
97. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 5 of 8
98. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 5 of 8
99. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 5 of 8
100. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 5 of 8
101. (move f4-3f f4-4f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-4f)
   goals met: 5 of 8
102. (unlock f4-4f f4-5f key1-0 shape1)
   deleted: (locked f4-5f)
   added: (open f4-5f)
   goals met: 5 of 8
103. (move f4-4f f4-5f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-5f)
   goals met: 5 of 8
104. (move f4-5f f4-6f)
   deleted: (at-robot f4-5f)
   added: (at-robot f4-6f)
   goals met: 5 of 8
105. (move f4-6f f5-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f5-6f)
   goals met: 5 of 8
106. (putdown f5-6f key1-0)
   deleted: (holding key1-0)
   added: (arm-empty) (at key1-0 f5-6f)
   goals met: 6 of 8
107. (move f5-6f f4-6f)
   deleted: (at-robot f5-6f)
   added: (at-robot f4-6f)
   goals met: 6 of 8
108. (move f4-6f f3-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f3-6f)
   goals met: 6 of 8
109. (move f3-6f f3-5f)
   deleted: (at-robot f3-6f)
   added: (at-robot f3-5f)
   goals met: 6 of 8
110. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 6 of 8
111. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 6 of 8
112. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 6 of 8
113. (move f3-2f f3-1f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-1f)
   goals met: 6 of 8
114. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 6 of 8
115. (move f4-1f f5-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f5-1f)
   goals met: 6 of 8
116. (move f5-1f f6-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f6-1f)
   goals met: 6 of 8
117. (move f6-1f f6-0f)
   deleted: (at-robot f6-1f)
   added: (at-robot f6-0f)
   goals met: 6 of 8
118. (pickup f6-0f key2-2)
   deleted: (at key2-2 f6-0f) (arm-empty)
   added: (holding key2-2)
   goals met: 6 of 8
119. (move f6-0f f6-1f)
   deleted: (at-robot f6-0f)
   added: (at-robot f6-1f)
   goals met: 6 of 8
120. (move f6-1f f5-1f)
   deleted: (at-robot f6-1f)
   added: (at-robot f5-1f)
   goals met: 6 of 8
121. (move f5-1f f4-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f4-1f)
   goals met: 6 of 8
122. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 6 of 8
123. (putdown f3-1f key2-2)
   deleted: (holding key2-2)
   added: (arm-empty) (at key2-2 f3-1f)
   goals met: 7 of 8
124. (move f3-1f f3-2f)
   deleted: (at-robot f3-1f)
   added: (at-robot f3-2f)
   goals met: 7 of 8
125. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 7 of 8
126. (move f3-3f f3-4f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-4f)
   goals met: 7 of 8
127. (move f3-4f f3-5f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-5f)
   goals met: 7 of 8
128. (move f3-5f f2-5f)
   deleted: (at-robot f3-5f)
   added: (at-robot f2-5f)
   goals met: 7 of 8
129. (pickup f2-5f key2-1)
   deleted: (at key2-1 f2-5f) (arm-empty)
   added: (holding key2-1)
   goals met: 7 of 8
130. (move f2-5f f2-4f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-4f)
   goals met: 7 of 8
131. (move f2-4f f3-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f3-4f)
   goals met: 7 of 8
132. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 7 of 8
133. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 7 of 8
134. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 7 of 8
135. (move f4-2f f5-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f5-2f)
   goals met: 7 of 8
136. (move f5-2f f5-1f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-1f)
   goals met: 7 of 8
137. (putdown f5-1f key2-1)
   deleted: (holding key2-1)
   added: (arm-empty) (at key2-1 f5-1f)
   goals met: 8 of 8
